export const NOUN = {
  solar: '阳历',
  year: '年',
  month: '月',
  day: '日',
  hour: '时',
  minute: '分',
  second: '秒',
  date: '日期',
  dateString: '阳历时间',
  lunar: '农历',
  lunarMonth: '农历月份',
  lunarDay: '农历日',
  isLeap: '是否闰月',
  lunarDateString: '农历时间',
  monthIndex: '月份索引',
  dateIndex: '日索引',
  currentSolarTerms: '前后节气',
  solarDateString: '真太阳时',
  hours: '时辰',
  solarTermName: '节气名称',
  seasonName: '季节名称',
  detailSeason: '季节细化',
  introduction: '简介',
  youLai: '由来',
  xiSu: '习俗',
  yangSheng: '养生建议',
  name: '名称',
  summary: '总结',
  qoutes: '引用',
  content: '内容',
  title: '标题',
  yinYang: '阴阳',
  opposite: '相反',
  wuXing: '五行',
  wuShu: '五行数字',
  wuFang: '五行方位',
  wuChang: '五常',
  wuZang: '五脏',
  liuFu: '六腑',
  wuSe: '五色',
  wuWei: '五味',
  wuZhi: '五志',
  shengWo: '生我者',
  keWo: '克我者',
  ke: '我克者',
  sheng: '我生者',
  liuShen: '六神',
  gan: '天干',
  zhi: '地支',
  tianWen: '天文',
  position: '方位',
  character: '性格特征',
  nature: '自然现象',
  feature: '特点',
  twelvePlace: '五行寄生十二宫',
  zhangSheng: '长生',
  muYu: '沐浴',
  guanDai: '冠带',
  linGuan: '临官',
  diWang: '帝旺',
  shuai: '衰',
  bing: '病',
  si: '死',
  mu: '墓',
  jue: '绝',
  tai: '胎',
  yang: '养',
  he: '合',
  hua: '化',
  chong: '冲',
  hui: '会',
  wuHudun: '五虎遁',
  wuShuDun: '五鼠遁',
  desc: '描述',
  organ: '器官',
  siYu: '四隅',
  siZheng: '四正',
  siKu: '四库',
  sanHui: '三会',
  sanHe: '三合',
  banHe: '半合',
  shengWang: '生旺半合',
  muWang: '墓旺半合',
  shengMu: '生墓拱合',
  cangGan: '地支藏干',
  benQi: '本气',
  zhongQi: '中气',
  yuQi: '余气',
  hai: '相害',
  po: '相破',
  xing: '相刑',
  anHe: '暗合',
  jingLuo: '经络',
  shenTiFa: '身体当令',
  forTarget: '我为',
  forMe: '为我',
  shiShen: '十神',
  bijian: '比肩',
  jiecai: '劫财',
  pianYin: '偏印',
  zhengYin: '正印',
  shishen: '食神', // 注意区分 shiShen
  shangguan: '伤官',
  qisha: '七杀',
  zhengguan: '正官',
  piancai: '偏财',
  zhengcai: '正财',
  shengXiao: '生肖',
  dili: '地理',
  zhangJu: '掌诀',
  siZhu: '四柱',
  nianZhu: '年柱',
  yueZhu: '月柱',
  riZhu: '日柱',
  shiZhu: '时柱',
  naYin: '纳音五行',
  taiYuan: '胎元',
  taiXi: '胎息',
  bianXing: '变星',
  mingGong: '命宫',
  shenGong: '身宫',
  siNing: '人元司令分野',
  yongShi: '用事',
  nth: '第',
  qiYun: '起运',
  jiaoYun: '交运',
  daYun: '大运',
  age: '年龄',
  bornDateString: '出生日期',
  shun: '顺',
  ni: '逆',
  qian: '前',
  hou: '后',
  liuYue: '流月',
  liuRi: '流日',
  liuShi: '流时',
  riYuan: '日元',
  yuanNan: '元男',
  yuanNv: '元女',
  mingZhu: '命主',
  qi: '气',
  xingYun: '星运',
  ziZuo: '自坐',
  kongWang: '空亡',
  liuJiaXunKong: '六甲旬空',
  siDaKong: '四大空亡',
  wuGuiKong: '五鬼空亡',
  jieLuKong: '截路空亡',
  shiShenKong: '十神空亡',
  wuXingKong: '五行空亡',
  keHaiKong: '克害空亡',
  poZuKong: '破祖空亡',
  mingKong: '命空',
  shenKong: '神空',
  luKong: '禄空',
  zhenKong: '真空',
  hunKong: '魂空',
  lianKong: '连空',
  suiKong: '随空',
  zhenJiaKong: '真假空亡',
  sanKong: '三空相会',
  jiKong: '吉空',
  xiongKong: '凶空',
  wuXingWangShuai: '五行旺衰',
  wangShuai: '旺衰',
  wang: '旺',
  xiang: '相',
  xiu: '休',
  qiu: '囚',
  touGan: '透干',
  deLing: '得令',
  deSheng: '得生',
  deZhu: '得助',
  tongGen: '通根',
  qiangGen: '强根',
  zhongGen: '中根',
  ruoGen: '弱根',
  deDi: '得地',
}

/** 季节 */
export const SEASON_NAME = ['春', '夏', '秋', '冬'] as const
/** 农历月份 */
export const LUNAR_MONTH = ['正', '二', '三', '四', '五', '六', '七', '八', '九', '十', '冬', '腊'] as const
export const LUNAR_MONTH_WITH_LEAP = [...LUNAR_MONTH.map(item => `闰${item}`)] as const
/** 农历日 */
export const LUNAR_DAY = [
  '初一',
  '初二',
  '初三',
  '初四',
  '初五',
  '初六',
  '初七',
  '初八',
  '初九',
  '初十',
  '十一',
  '十二',
  '十三',
  '十四',
  '十五',
  '十六',
  '十七',
  '十八',
  '十九',
  '二十',
  '廿一',
  '廿二',
  '廿三',
  '廿四',
  '廿五',
  '廿六',
  '廿七',
  '廿八',
  '廿九',
  '三十',
] as const
/** 节气： [节气名称, 黄经, 气候特点，物候现象, 农事活动]*/
export const SOLAR_TERM = [
  [
    '立春',
    '315°',
    '气温开始回升，天气渐暖，多风，仍有寒意，但大地开始解冻',
    '东风解冻，蛰虫始振，鱼陟负冰',
    '准备春耕，如翻土、积肥、修理农具等',
  ],
  [
    '雨水',
    '330°',
    '降水增多，春雨绵绵，空气湿度上升',
    '獭祭鱼，鸿雁来，草木萌动',
    '灌溉农田，蓄水保墒，播种早春作物（如菠菜、生菜等）',
  ],
  [
    '惊蛰',
    '345°',
    '天气转暖，春雷始鸣，惊醒蛰伏昆虫',
    '桃始华，仓庚鸣，鹰化为鸠',
    '春耕大忙，春播作物全面播种，如玉米、大豆等，加强麦田管理',
  ],
  [
    '春分',
    '0°',
    '昼夜平分，阳光直射赤道，气温温和，春暖花开',
    '玄鸟至，雷乃发声，始电',
    '抓紧春灌，施肥，防治病虫害，植树造林',
  ],
  [
    '清明',
    '15°',
    '天气清澈明朗，气温升高，雨量增多',
    '桐始华，田鼠化为鹌，虹始见',
    '播种早稻，茶树新芽初展，采摘明前茶，防治病虫害',
  ],
  [
    '谷雨',
    '30°',
    '降水明显增加，利于谷类作物生长',
    '萍始生，鸣鸠拂其羽，戴胜降于桑',
    '播种移苗，埯瓜点豆，防治病虫害，渔业生产进入旺季',
  ],
  [
    '立夏',
    '45°',
    '夏天开始，气温显著升高，雷雨增多',
    '蝼蝈鸣，蚯蚓出，王瓜生',
    '冬小麦扬花灌浆，油菜接近成熟，及时灌溉施肥，中耕除草',
  ],
  [
    '小满',
    '60°',
    '夏熟作物籽粒开始灌浆饱满，但未成熟',
    '苦菜秀，靡草死，小暑至',
    '北方麦类加强后期管理，南方稻田追肥耘田，注意防汛',
  ],
  [
    '芒种',
    '75°',
    '雨量充沛，气温升高，是农事最繁忙时节',
    '螳螂生，鹏始鸣，反舌无声',
    '收割小麦、油菜，播种谷子、玉米等秋熟作物，插秧种稻',
  ],
  [
    '夏至',
    '90°',
    '北半球白昼最长，黑夜最短，气温高，闷热潮湿',
    '鹿角解，蝉始鸣，半夏生',
    '加强田间管理，及时灌溉施肥，防治病虫害，牲畜防暑降温',
  ],
  [
    '小暑',
    '105°',
    '天气开始炎热，但还未到最热，雷暴天气增多',
    '温风至，蟋蟀居壁，鹰始鸷',
    '农作物茁壮成长，加强田间管理，中耕除草，追肥防虫',
  ],
  [
    '大暑',
    '120°',
    '一年中最热，高温酷热，雷暴频繁',
    '腐草为萤，土润溽暑，大雨时行',
    '早稻收获，晚稻管理，棉花整枝打顶，防旱排涝',
  ],
  [
    '立秋',
    '135°',
    '秋季开始，气温逐渐下降，昼夜温差变大',
    '凉风至，白露生，寒蝉鸣',
    '收获玉米、高粱等作物，加强果园管理，防治病虫害',
  ],
  [
    '处暑',
    '150°',
    '炎热即将过去，气温下降，昼夜温差加大',
    '鹰乃祭鸟，天地始肃，禾乃登',
    '收割早熟作物，加强秋菜管理，棉花吐絮采摘',
  ],
  [
    '白露',
    '165°',
    '天气转凉，昼夜温差大，露水凝结成白色',
    '鸿雁来，玄鸟归，群鸟养羞',
    '收获谷子、大豆等作物，棉花分批采摘，防治秋虫',
  ],
  [
    '秋分',
    '180°',
    '昼夜平分，阳光直射赤道，气温降低，天气凉爽',
    '雷始收声，蛰虫坯户，水始涸',
    '秋收大忙，收获玉米、花生、红薯等，播种冬小麦',
  ],
  [
    '寒露',
    '195°',
    '气温更低，露水更冷，快要凝结成霜',
    '鸿雁来宾，雀入大水为蛤，菊有黄华',
    '北方收获大豆、棉花等，南方播种油菜，加强果园管理',
  ],
  [
    '霜降',
    '210°',
    '秋季最后一个节气，天气寒冷，初霜出现',
    '豺乃祭兽，草木黄落，蛰虫咸俯',
    '收获红薯、萝卜等根茎类作物，采摘柿子、苹果等水果，加强农田水利建设',
  ],
  [
    '立冬',
    '225°',
    '冬季开始，气温下降，天气寒冷，寒风乍起',
    '水始冰，地始冻，雉入大水为蜃',
    '农作物收割完毕，收藏入库，开展农田水利建设，给牲畜保暖',
  ],
  [
    '小雪',
    '240°',
    '气温下降，开始下雪，但雪量不大',
    '虹藏不见，天气上升，闭塞成冬',
    '贮藏蔬菜、粮食，给果树修枝，加强牲畜管理',
  ],
  [
    '大雪',
    '255°',
    '雪往往下得大、范围广，天气寒冷',
    '鹖鴠不鸣，虎始交，荔挺出',
    '加强牲畜防寒保暖，保护越冬蔬菜，清沟排水，预防积雪压塌房屋',
  ],
  [
    '冬至',
    '270°',
    '北半球白昼最短，黑夜最长，此后白昼渐长',
    '蚯蚓结，麋角解，水泉动',
    '加强冬小麦等越冬作物田间管理，增施腊肥，做好防寒防冻',
  ],
  [
    '小寒',
    '285°',
    '开始进入一年中最寒冷日子，土壤冻结，河流封冻',
    '雁北乡，鹊始巢，雉雊',
    '做好农作物防寒防冻，加强牲畜冬季饲养管理，积肥造肥',
  ],
  [
    '大寒',
    '300°',
    '天气寒冷到极点，常出现冰天雪地',
    '鸡始乳，鸷鸟厉疾，水泽腹坚',
    '加强越冬作物田间管理，准备春耕春种物资，迎接新年',
  ],
] as const

/** 阴阳 */
export const YIN_YANG_NAME = ['阴', '阳'] as const
/** 五行 */
export const WX_NAME = ['木', '火', '土', '金', '水'] as const
/** 五数 */
export const WX_SHU = [
  /** 五行数字 */
  [3, 8], // 木
  [2, 7], // 火
  [5, 10], // 土
  [4, 9], // 金
  [1, 6], // 水
] as const
/** 五行方位 */
export const WU_FANG_NAME = ['东', '南', '中', '西', '北'] as const
/** 五常 */
export const WU_CHANG_NAME = ['仁', '礼', '信', '义', '智'] as const
/** 五脏 */
export const WU_ZANG_NAME = ['肝', '心', '脾', '肺', '肾'] as const
/** 六腑 */
export const LIU_FU_NAME = ['胆', '小肠', '胃', '大肠', '膀胱'] as const
/** 五色 */
export const WU_SE_NAME = ['青', '赤', '黄', '白', '黑'] as const
/** 五味 */
export const WU_WEI_NAME = ['酸', '苦', '甘', '辛', '咸'] as const
/** 五志 */
export const WU_ZHI_NAME = ['怒', '喜', '思', '悲', '恐'] as const
/** 六神 */
export const LIU_SHEN_NAME = ['青龙', '朱雀', '勾陈', '腾蛇', '白虎', '玄武'] as const
/** 天干 */
export const GAN_NAME = ['甲', '乙', '丙', '丁', '戊', '己', '庚', '辛', '壬', '癸'] as const
/** 地支 */
export const ZHI_NAME = ['子', '丑', '寅', '卯', '辰', '巳', '午', '未', '申', '酉', '戌', '亥'] as const
/** 五行对应六神 */
export const WX_LIUSHEN = ['青龙', '朱雀', ['勾陈', '腾蛇'], '白虎', '玄武'] as const
/** 五行对应天干 */
export const WX_TIAN_GAN = [
  ['甲', '乙'],
  ['丙', '丁'],
  ['戊', '己'],
  ['庚', '辛'],
  ['壬', '癸'],
] as const
/** 五行对应地支 */
export const WX_DI_ZHI = [
  ['寅', '卯'],
  ['巳', '午'],
  ['辰', '戌', '丑', '未'],
  ['申', '酉'],
  ['亥', '子'],
] as const

/** 十天干对应天文 */
export const GAN_TIAN_WEN = ['雷', '风', '日', '星', '霞', '云', '月', '霜', '秋露', '春霖'] as const
/** 天干对应六神 */
export const GAN_LIU_SHEN = [
  ['甲', '青龙'],
  ['丙', '朱雀'],
  ['戊', '勾陈'],
  ['己', '腾蛇'],
  ['庚', '白虎'],
  ['壬', '玄武'],
] as const
/** 天干五合 */
export const GAN_HE = [
  [
    '甲',
    '己',
    '土',
    '中正之合',
    '甲木正直仁慈，己土宁静祥和，组合相对中和公正，有端庄、正直的特点，在人际关系、行事风格等方面比较中规中矩。',
  ],
  [
    '乙',
    '庚',
    '金',
    '仁义之合',
    '庚金强硬锐利，有威严，乙木柔顺，合化后有以刚制柔的感觉，象征威严、制约，在夫妻关系等情境下可能体现一方对另一方有较强的管束。',
  ],
  [
    '丙',
    '辛',
    '水',
    '威制之合',
    '丙火热情奔放，辛金锐利冷静，两者相遇，有相互克制、平衡的一面，也带有威严的气息，表现出一种制约与被制约的关系。',
  ],
  [
    '丁',
    '壬',
    '木',
    '淫慝之合',
    '丁火激情浪漫，壬水灵动多变，在传统观念里，这种组合被认为可能会出现情感放纵、不稳定的情况，不过这带有迷信色彩。',
  ],
  [
    '戊',
    '癸',
    '火',
    '无情之合',
    '戊土厚重、实在，癸水阴柔、多变，两者性质差异较大，好像缺乏深情厚谊的基础，合化时可能给人感觉比较勉强。',
  ],
] as const
/** 天干四冲 */
export const GAN_CHONG = [
  ['甲', '庚'],
  ['乙', '辛'],
  ['丙', '壬'],
  ['丁', '癸'],
] as const
/** 五行寄生十二宫 */
export const TWELVE_PLACE_NAME = [
  '长生',
  '沐浴',
  '冠带',
  '临官',
  '帝旺',
  '衰',
  '病',
  '死',
  '墓',
  '绝',
  '胎',
  '养',
] as const
/** 天干其他表象：[天干, 方位, 季节细化, 性格特征, 自然现象, 器官脏腑] */

export const GAN_OTHERS = [
  [
    '甲',
    '正东方', // 甲为阳木，为东方木气之始，主正位
    '孟春（立春-惊蛰）', // 正月建寅，木气始发
    '刚健正直、积极进取、果决豪迈，如苍松翠柏般挺拔不屈', // 甲为栋梁之木，主刚健
    '参天乔木、山林巨木，春日抽芽的松柏，象征生命力的初始勃发',
    '头部、胆',
  ],
  [
    '乙',
    '东南方', // 乙为阴木，随甲木之气后行，位稍偏
    '仲春（惊蛰-清明）', // 二月建卯，木气盛而未极
    '柔韧包容、灵巧变通、温和仁慈，如藤蔓柳枝般曲直随形', // 乙为花草之木，主柔韧
    '藤蔓花草、灌木绿篱，二月抽条的柳枝，展现柔和的生命力延伸',
    '肩部、颈部、神经、肝',
  ],
  [
    '丙',
    '正南方', // 丙为阳火，南方离位
    '孟夏（立夏-芒种）', // 四月建巳，火气始发
    '热情光明、果断磊落、威严外显，如烈日当空般炽热刚猛', // 丙为太阳之火
    '正午烈日、燃烧的篝火，夏季初盛的红棉树，象征能量的剧烈释放',
    '额头、肩部、小肠',
  ],
  [
    '丁',
    '西南方', // 丁为阴火，随丙火之气后行
    '仲夏（芒种-小暑）', // 五月建午，火气极盛
    '灵动细腻、温和优雅、内秀含蓄，如烛火星光般温暖柔和', // 丁为灯烛之火
    '夜晚灯火、流萤星光，盛夏绽放的石榴花，展现细腻的光明之美',
    '齿舌、心、血液系统',
  ],
  [
    '戊',
    '中央', // 戊为阳土，位居中央
    '季夏（小暑-立秋）', // 长夏主土，六月建未
    '敦厚持重、包容宽宏、踏实可靠，如高山厚土般稳固承载', // 戊为城墙之土
    '高山丘陵、厚实土坡，夏末成熟的麦田，象征稳定的承载力量',
    '鼻、面、胃',
  ],
  [
    '己',
    '中央偏东南', // 己为阴土，随戊土之气布化
    '季夏末（立秋前十八日）', // 土寄旺于四季末
    '温和细腻、善谋善持、圆融变通，如田园沃土般滋养万物', // 己为田园之土
    '肥沃田垄、湿润泥土，夏末待收的稻穗，展现滋养的包容特性',
    '鼻、面、腹部、脾',
  ],
  [
    '庚',
    '正西方', // 庚为阳金，西方兑位
    '孟秋（立秋-白露）', // 七月建申，金气始发
    '刚直果决、威严锐利、原则性强，如刀斧剑戟般锋锐肃杀', // 庚为斧钺之金
    '金属矿石、深秋山林，八月初落的银杏，象征肃杀的收敛之力',
    '筋、脐轮、大肠',
  ],
  [
    '辛',
    '西北方', // 辛为阴金，随庚金之气后行
    '仲秋（白露-寒露）', // 八月建酉，金气极盛
    '温润灵动、精致秀气、明辨是非，如珠玉金银般莹润通透', // 辛为珠玉之金
    '金银器饰、晨露结霜，九月初开的桂花，展现精致的收敛之美',
    '胸部、股部、肺',
  ],
  [
    '壬',
    '正北方', // 壬为阳水，北方坎位
    '孟冬（立冬-大雪）', // 十月建亥，水气始发
    '豁达包容、智慧深远、流动不息，如江河湖海般浩瀚绵长', // 壬为江河之水
    '奔涌江河、浩荡海洋，冬日初冻的溪流，象征无穷的流动力量',
    '胫部、膀胱、三焦',
  ],
  [
    '癸',
    '东北方', // 癸为阴水，随壬水之气后行
    '仲冬（大雪-小寒）', // 十一月建子，水气极盛
    '细腻含蓄、深沉内敛、润物无声，如泉水雨露般清冽幽微', // 癸为雨露之水
    '山间清泉、晨雾雨露，隆冬凝结的霜花，展现幽微的滋养特性',
    '足部、肾、心包络',
  ],
] as const

/** 生肖 */
export const SHENG_XIAO_NAME = ['鼠', '牛', '虎', '兔', '龙', '蛇', '马', '羊', '猴', '鸡', '狗', '猪'] as const
/** 地理 */
export const DI_LI_NAME = [
  '墨池',
  '柳岸',
  '广谷',
  '琼林',
  '草泽',
  '大驿',
  '烽堠',
  '花园',
  '名都',
  '寺钟',
  '烧原',
  '悬河',
] as const
/** 四正|四旺（子午卯酉）旺：水火木金 */
export const SI_ZHENG_NAME = [
  ['子', '水'],
  ['午', '火/土'],
  ['卯', '木'],
  ['酉', '金'],
] as const
/** 四隅|四长生（寅申巳亥）长生：火水金木 */
export const SI_YU_NAME = [
  ['寅', '火'],
  ['申', '水'],
  ['巳', '金'],
  ['亥', '木'],
] as const

/** 四库｜四墓（辰戌丑未）, 皆属土 墓： 水 火 金 木 */
export const SI_KU_NAME = [
  ['辰', '水'],
  ['戌', '火'],
  ['丑', '金'],
  ['未', '木'],
] as const
/** 地支三会 */
export const ZHI_SAN_HUI = [
  ['寅', '卯', '辰', '木'],
  ['巳', '午', '未', '火'],
  ['申', '酉', '戌', '金'],
  ['亥', '子', '丑', '水'],
] as const
/** 地支三合 */
export const ZHI_SAN_HE = [
  ['亥', '卯', '未', '木'],
  ['寅', '午', '戌', '火'],
  ['巳', '酉', '丑', '金'],
  ['申', '子', '辰', '水'],
] as const
/** 生旺半合 */
export const SHENG_WANG = [
  ['申', '子', '水'],
  ['寅', '午', '火'],
  ['亥', '卯', '木'],
  ['巳', '酉', '金'],
] as const
/** 墓旺半合 */
export const MU_WANG = [
  ['子', '辰', '水'],
  ['午', '戌', '火'],
  ['卯', '未', '木'],
  ['酉', '丑', '金'],
] as const
/** 生墓拱合 */
export const SHENG_MU = [
  ['申', '辰', '水'],
  ['寅', '戌', '火'],
  ['巳', '丑', '金'],
  ['亥', '未', '木'],
] as const
/** 地支藏干 */
export const ZHI_CANG_GAN = [
  ['子', '癸', null, null],
  ['丑', '己', '癸', '辛'],
  ['寅', '甲', '丙', '戊'],
  ['卯', '乙', null, null],
  ['辰', '戊', '乙', '癸'],
  ['巳', '丙', '庚', '戊'],
  ['午', '丁', '己', null],
  ['未', '己', '丁', '乙'],
  ['申', '庚', '壬', '戊'],
  ['酉', '辛', null, null],
  ['戌', '戊', '辛', '丁'],
  ['亥', '壬', '甲', null],
] as const
/** 掌诀: 原点为 中指末关节 和 无名指末关节 中间 */
export const FINGER_POSITION = [
  [1, 0], // 子
  [-1, 0], // 丑
  [-3, 0], // 寅
  [-3, 1], // 卯
  [-3, 2], // 辰
  [-3, 3], // 巳
  [-1, 3], // 午
  [1, 3], // 未
  [3, 3], // 申
  [3, 2], // 酉
  [3, 1], // 戌
  [3, 0], // 亥
] as const
/** 地支六合 */
export const ZHI_HE = [
  ['子', '丑', '土/水', '泥合'],
  ['寅', '亥', '木', '义合'],
  ['卯', '戌', '火', '淫合'],
  ['辰', '酉', '金', '融合'],
  ['巳', '申', '水', '刑合'],
  ['午', '未', '土/火', '和合'],
] as const
/** 地支六冲*/
export const ZHI_CHONG = [
  ['子', '午'],
  ['丑', '未'],
  ['寅', '申'],
  ['卯', '酉'],
  ['辰', '戌'],
  ['巳', '亥'],
] as const
/** 地支六害 */
export const ZHI_HAI = [
  ['子', '未', '势家相害'],
  ['丑', '午', '官鬼相害'],
  ['寅', '巳', '临官相害'],
  ['卯', '辰', '凌长相害'],
  ['申', '亥', '争进相害'],
  ['酉', '戌', '嫉妒相害'],
] as const
/** 地支六破 */
export const ZHI_PO = [
  ['子', '酉'],
  ['午', '卯'],
  ['寅', '亥'],
  ['巳', '申'],
  ['辰', '丑'],
  ['戌', '未'],
] as const
/** 地支相刑 */
export const ZHI_XING = [
  ['寅', '巳', '无恩之刑'],
  ['巳', '申', '无恩之刑'],
  ['申', '寅', '无恩之刑'],
  ['丑', '戌', '恃势之刑'],
  ['戌', '未', '恃势之刑'],
  ['未', '丑', '恃势之刑'],
  ['子', '卯', '无礼之刑'],
  ['辰', '辰', '自刑之刑'],
  ['午', '午', '自刑之刑'],
  ['酉', '酉', '自刑之刑'],
  ['亥', '亥', '自刑之刑'],
] as const
/** 地支三刑 */
export const ZHI_SAN_XING = [
  ['寅', '巳', '申', '无恩之刑'],
  ['丑', '戌', '未', '恃势之刑'],
] as const

/** 地支暗合 */
export const ZHI_AN_HE = [
  ['寅', '丑', '通合'],
  ['亥', '午', '通合'],
  ['卯', '申', '通禄合'],
  ['巳', '酉', '通禄合'],
  ['子', '巳', '通禄合'],
  ['寅', '午', '通禄合'],
] as const
/** 地支其他表象: [地支名称、器官， 时间， 季节细化， 方位， 十二经, 身体当令] */
export const ZHI_OTHERS = [
  ['子', '膀胱、耳朵、泌尿系统', '23时至01时', '孟冬（立冬 - 大雪）', '正北偏东', '足太阳膀胱经', '阳气开始生发'],
  [
    '丑',
    '腹部、脾胃、子宫、喉部',
    '01时至03时',
    '仲冬（大雪 - 小寒）',
    '正北偏西',
    '足太阴脾经',
    '肝经当令，肝脏排毒等生理活动活跃',
  ],
  [
    '寅',
    '胆、毛发、手臂、肩膀、腿部',
    '03时至05时',
    '孟春（立春 - 惊蛰）',
    '正东偏北',
    '手太阴肺经',
    '肺经当令，气血重新分配',
  ],
  [
    '卯',
    '肝脏、神经、手指、脚趾',
    '05时至07时',
    '仲春（惊蛰 - 清明）',
    '正东偏南',
    '手阳明大肠经',
    '大肠经当令，人们常起床排便',
  ],
  ['辰', '胃、皮肤、胸部、肩部', '07时至09时', '季春（清明 - 立夏）', '正东', '足阳明胃经', '胃经当令，吃早餐时间'],
  [
    '巳',
    '面部、咽喉、牙齿、心脏',
    '09时至11时',
    '孟夏（立夏 - 小满）',
    '正南偏东',
    '足太阴脾经',
    '脾经当令，消化吸收功能活跃',
  ],
  ['午', '眼睛、心脏、小肠', '11时至13时', '仲夏（小满 - 小暑）', '正南偏西', '手太阳小肠经', '心经当令，阳气最盛'],
  ['未', '胃、脊柱、腹部', '13时至15时', '季夏（小暑 - 立秋）', '正南', '手少阳三焦经', '小肠经当令，营养吸收活动'],
  ['申', '大肠、经络、肺部', '15时至17时', '孟秋（立秋 - 白露）', '正西偏南', '足少阳胆经', '膀胱经当令，水液代谢重要'],
  ['酉', '肺部、喉咙、精血', '17时至19时', '仲秋（白露 - 寒露）', '正西偏北', '手太阴肺经', '肾经当令，肾脏功能活跃'],
  [
    '戌',
    '腿、脚踝、命门（肾上腺）',
    '19时至21时',
    '季秋（寒露 - 立冬）',
    '正西',
    '足厥阴肝经',
    '心包经当令，休闲娱乐时间',
  ],
  [
    '亥',
    '肾脏、头部、生殖系统',
    '21时至23时',
    '孟冬（立冬 - 大雪）',
    '正北偏西',
    '足少阴肾经',
    '三焦经当令，准备进入睡眠',
  ],
] as const

/** 十神 */
export const SHI_SHEN_NAME = [
  ['比肩', '劫财'], // 同我者为比劫
  ['偏印', '正印'], // 生我者为枭印
  ['食神', '伤官'], // 我生者为食伤
  ['七杀', '正官'], // 克我者为官杀
  ['偏财', '正财'], // 我克者为财
] as const

/** 纳音五行 */
export const NAYIN_WUXING = [
  ['甲子', '乙丑', '海中金'],
  ['丙寅', '丁卯', '炉中火'],
  ['戊辰', '己巳', '大林木'],
  ['庚午', '辛未', '路旁土'],
  ['壬申', '癸酉', '剑锋金'],
  ['甲戌', '乙亥', '山头火'],
  ['丙子', '丁丑', '涧下水'],
  ['戊寅', '己卯', '城头土'],
  ['庚辰', '辛巳', '白蜡金'],
  ['壬午', '癸未', '杨柳木'],
  ['甲申', '乙酉', '泉中水'],
  ['丙戌', '丁亥', '屋上土'],
  ['戊子', '己丑', '霹雳火'],
  ['庚寅', '辛卯', '松柏木'],
  ['壬辰', '癸巳', '长流水'],
  ['甲午', '乙未', '沙中金'],
  ['丙申', '丁酉', '山下火'],
  ['戊戌', '己亥', '平地木'],
  ['庚子', '辛丑', '壁上土'],
  ['壬寅', '癸卯', '金箔金'],
  ['甲辰', '乙巳', '覆灯火'],
  ['丙午', '丁未', '天河水'],
  ['戊申', '己酉', '大驿土'],
  ['庚戌', '辛亥', '钗钏金'],
  ['壬子', '癸丑', '桑柘木'],
  ['甲寅', '乙卯', '太溪水'],
  ['丙辰', '丁巳', '沙中土'],
  ['戊午', '己未', '天上火'],
  ['庚申', '辛酉', '石榴木'],
  ['壬戌', '癸亥', '大海水'],
] as const
/** 人元司令分野 */
export const SINING_NAME = [
  ['子', ['壬水', 10], ['癸水', 20]],
  ['丑', ['癸水', 9], ['辛金', 3], ['己土', 18]],
  ['寅', ['戊土', 7], ['丙火', 7], ['甲木', 16]],
  ['卯', ['甲木', 10], ['乙木', 20]],
  ['辰', ['乙木', 9], ['癸水', 3], ['戊土', 18]],
  ['巳', ['戊土', 5], ['庚金', 9], ['丙火', 16]],
  ['午', ['丙火', 10], ['己土', 9], ['丁火', 11]],
  ['未', ['丁火', 9], ['乙木', 3], ['己土', 18]],
  ['申', ['戊己土', 10], ['壬癸水', 3], ['庚金', 17]],
  ['酉', ['庚金', 10], ['辛金', 20]],
  ['戌', ['辛金', 9], ['丁火', 3], ['戊土', 18]],
  ['亥', ['戊土', 7], ['甲木', 5], ['壬水', 18]],
] as const
/** 根据月支获取节气范围 */
export const SOLAR_TERMS_RANGE = {
  // 寅月(索引2)对应立春(2)~惊蛰(4)
  2: [2, 3, 4], // 立春、雨水、惊蛰
  3: [4, 5, 6], // 惊蛰、春分、清明
  4: [6, 7, 8], // 清明、谷雨、立夏
  5: [8, 9, 10], // 立夏、小满、芒种
  6: [10, 11, 12], // 芒种、夏至、小暑
  7: [12, 13, 14], // 小暑、大暑、立秋
  8: [14, 15, 16], // 立秋、处暑、白露
  9: [16, 17, 18], // 白露、秋分、寒露
  10: [18, 19, 20], // 寒露、霜降、立冬
  11: [20, 21, 22], // 立冬、小雪、大雪
  0: [22, 23, 24], // 大雪、冬至、小寒
  1: [24, 25, 26], // 小寒、大寒, 下一年立春
}

/**
 * 六甲旬空
 */
export const LIU_JIA_XUN_KONG = [
  ['甲子', '戌', '亥'],
  ['甲戌', '申', '酉'],
  ['甲申', '午', '未'],
  ['甲午', '辰', '巳'],
  ['甲辰', '寅', '卯'],
  ['甲寅', '子', '丑'],
] as const

/** 截路空亡 */
export const JIE_LU_KONG = [
  ['甲己', '申', '酉'],
  ['乙庚', '午', '未'],
  ['丙辛', '辰', '巳'],
  ['丁壬', '寅', '卯'],
  ['戊癸', '子', '丑'],
] as const

/** 四大空亡 */
export const SI_DA_KONG = [
  ['甲子', '甲午', '水'],
  ['甲寅', '甲申', '金'],
] as const

/** 五鬼空亡
 * 甲己日见巳午，乙庚日见寅卯，丙辛日见子丑，丁壬日见戌亥，戊癸日见申酉
 */
export const WU_GUI_KONG = [
  ['甲己', '巳', '午'],
  ['乙庚', '寅', '卯'],
  ['丙辛', '子', '丑'],
  ['丁壬', '戌', '亥'],
  ['戊癸', '申', '酉'],
] as const

/** 克害空亡
 * 甲乙日见午，丙丁日见申，戊己日见巳，庚辛日见寅，壬癸日见酉丑
 */
export const KE_HAI_KONG = [
  ['甲乙', '午'],
  ['丙丁', '申'],
  ['戊己', '巳'],
  ['庚辛', '寅'],
  ['壬癸', '酉', '丑'],
] as const

/** 破祖空亡
 * 甲乙丙丁日见午，戊己日见戌，庚辛日见子，壬癸日见寅
 */
export const PO_ZU_KONG = [
  ['甲乙丙丁', '午'],
  ['戊己', '戌'],
  ['庚辛', '子'],
  ['壬癸', '寅'],
] as const

/** 五行旺衰 */
export const WU_XING_WANG_SHUAI = [
  ['寅', ['木', '旺', 1.571], ['火', '相', 1.548], ['土', '死', 0.924], ['金', '囚', 0.716], ['水', '休', 0.862]],
  ['卯', ['木', '旺', 2.0], ['火', '相', 1.414], ['土', '死', 0.5], ['金', '囚', 0.707], ['水', '休', 1.0]],
  ['辰', ['木', '囚', 1.166], ['火', '休', 1.074], ['土', '旺', 1.421], ['金', '相', 1.161], ['水', '死', 0.8]],
  ['巳', ['木', '休', 0.862], ['火', '旺', 1.571], ['土', '相', 1.548], ['金', '死', 0.716], ['水', '囚', 0.924]],
  ['午', ['木', '休', 0.912], ['火', '旺', 1.7], ['土', '相', 1.59], ['金', '死', 0.645], ['水', '囚', 0.774]],
  ['未', ['木', '囚', 0.924], ['火', '休', 1.341], ['土', '旺', 1.674], ['金', '相', 1.069], ['水', '死', 0.612]],
  ['申', ['木', '死', 0.795], ['火', '囚', 0.674], ['土', '休', 1.012], ['金', '旺', 1.641], ['水', '相', 1.498]],
  ['酉', ['木', '死', 0.5], ['火', '囚', 0.707], ['土', '休', 1.0], ['金', '旺', 2.0], ['水', '相', 1.414]],
  ['戌', ['木', '囚', 0.674], ['火', '休', 1.012], ['土', '旺', 1.641], ['金', '相', 1.498], ['水', '死', 0.795]],
  ['亥', ['木', '相', 1.59], ['火', '死', 0.774], ['土', '囚', 0.645], ['金', '休', 0.912], ['水', '旺', 1.7]],
  ['子', ['木', '相', 1.414], ['火', '死', 0.5], ['土', '囚', 0.707], ['金', '休', 1.0], ['水', '旺', 2.0]],
  ['丑', ['木', '囚', 0.898], ['火', '休', 0.821], ['土', '旺', 1.512], ['金', '相', 1.348], ['水', '死', 1.041]],
] as const
